---
kind: type
id: T:Autodesk.Revit.DB.UnitSystem
source: html/3512b3c9-22de-e26e-f08a-0dca8f86820e.htm
---
# Autodesk.Revit.DB.UnitSystem

A system of measurement: Metric or Imperial units.

## Syntax (C#)
```csharp
public enum UnitSystem
```